"""
 Реализовать два небольших скрипта:

    итератор, генерирующий целые числа, начиная с указанного;
    итератор, повторяющий элементы некоторого списка, определённого заранее.
    Подсказка: используйте функцию count() и cycle() модуля itertools.
    Обратите внимание, что создаваемый цикл не должен быть бесконечным.
    Предусмотрите условие его завершения. #### Например, в первом задании выводим целые числа, начиная с
    3. При достижении числа 10 — завершаем цикл.
    Вторым пунктом необходимо предусмотреть условие, при котором повторение элементов списка прекратится.

"""
from itertools import count, cycle
for n in count (3):
    if n > 10:
        break
    print(n)

i = 1
for n in cycle (["one", "two", "three"]):
    print(n)
    if i > 3:
        break
    i = i + 1